InformationRegisters/ОчередьОтправкиСтатусовПоЗаказам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОчередьОтправкиСтатусовПоЗаказам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПредполагаемойОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:CatalogRef.НеСозданныеЗаказыПокупателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ГрузовоеМесто.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ГрузовоеМесто</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сборка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборкаЗаказовПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Погружено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Неактуально_КорректировкаСборки</Name>
					<Comment>Документ неактуален вследствие корректировки сборки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректировкаСборки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаСборкиЗаказовПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеализацияСамовывоза</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШКОбособленного</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПечатиШтрихкода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихкодГрузовогоМеста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПогрузкаВАвто.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПогрузкаВАвто</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданиеНаДоставку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клеверенс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Погружено</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузоместо</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ТранспортнаяЕдиница</v8:Type>
								<v8:Type>cfg:DocumentRef.СлужебнаяЗаписка</v8:Type>
								<v8:Type>cfg:DocumentRef.ГрузовоеМесто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ИсходящиеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИсходящиеСообщения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВремяСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПубликации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючМаршрутизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Р_ВходящиеСообщения</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БылаОшибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Свойства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Заголовки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СтатусыЗаказов/Ext/Module.bsl
///////////////////Вызовы из подписок и регламентов///////////////////

Процедура ПодпискаНаСобытиеПриПроведенииСтатусыЗаказов(Источник, Отказ, РежимПроведения) Экспорт

	Если Константы.ЗаписыватьДанныеВРегистрСтатусыЗаказов.Получить() Тогда
		ПоместитьВОчередьВФоне(Источник);
		//РегистрыСведений.СтатусыЗаказаПокупателя.ДобавитьЗаписьСтатусаЗаказа(Источник, Отказ);
	КонецЕсли;

КонецПроцедуры	

Процедура ПодпискаНаСобытиеПриУдаленияПроведенияСтатусыЗаказов(Источник, Отказ) Экспорт

	Если Константы.ЗаписыватьДанныеВРегистрСтатусыЗаказов.Получить() Тогда          
		ПоместитьВОчередьВФоне(Источник);
		//РегистрыСведений.СтатусыЗаказаПокупателя.ДобавитьЗаписьСтатусаЗаказа(Источник, Отказ, Истина);
	КонецЕсли;

КонецПроцедуры

Процедура ОтправкаСтатусовЗаказовИзОчереди() Экспорт
	
	ДатаОтправки = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 100
	|	ОчередьОтправкиСтатусовПоЗаказам.ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ОчередьОтправкиСтатусовПоЗаказам.ЗаказПокупателя ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ВЫРАЗИТЬ(ОчередьОтправкиСтатусовПоЗаказам.ЗаказПокупателя КАК Документ.ЗаказПокупателя).IDЗаказаПортал
	|		КОГДА ОчередьОтправкиСтатусовПоЗаказам.ЗаказПокупателя ССЫЛКА Справочник.НеСозданныеЗаказыПокупателей
	|			ТОГДА ВЫРАЗИТЬ(ОчередьОтправкиСтатусовПоЗаказам.ЗаказПокупателя КАК Справочник.НеСозданныеЗаказыПокупателей).IDЗаказаПортал
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИдентификаторЧисло
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	РегистрСведений.ОчередьОтправкиСтатусовПоЗаказам КАК ОчередьОтправкиСтатусовПоЗаказам
	|ГДЕ
	|	ОчередьОтправкиСтатусовПоЗаказам.ДатаПредполагаемойОтправки <= &ДатаОтправки
	|	И ОчередьОтправкиСтатусовПоЗаказам.КоличествоПопытокОтправки < 5
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОчередьОтправкиСтатусовПоЗаказам.ЗаказПокупателя.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заказ.Ссылка КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ВТ_ДопЗаказы
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК Заказ
	|		ПО (ВЫБОР
	|					КОГДА ВТ_Заказы.ИдентификаторЧисло <> 0
	|						ТОГДА ВТ_Заказы.ИдентификаторЧисло = Заказ.IDЗаказаПортал
	|				КОНЕЦ
	|				И НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(ВТ_Заказы.ЗаказПокупателя КАК Документ.ЗаказПокупателя).Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(Заказ.Дата, ДЕНЬ))
	|ГДЕ
	|	ВТ_Заказы.ИдентификаторЧисло <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НеСозданныеЗаказыПокупателей.Ссылка
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НеСозданныеЗаказыПокупателей КАК НеСозданныеЗаказыПокупателей
	|		ПО (ВЫБОР
	|				КОГДА ВТ_Заказы.ИдентификаторЧисло <> 0
	|					ТОГДА ВТ_Заказы.ИдентификаторЧисло = НеСозданныеЗаказыПокупателей.IDЗаказаПортал
	|			КОНЕЦ)
	|ГДЕ
	|	ВТ_Заказы.ИдентификаторЧисло <> 0
	|	И НеСозданныеЗаказыПокупателей.ЗаказПокупателяСсылка = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.ЗаказПокупателя
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ДопЗаказы.ЗаказПокупателя
	|ИЗ
	|	ВТ_ДопЗаказы КАК ВТ_ДопЗаказы
	|ГДЕ
	|	НЕ ВТ_ДопЗаказы.ЗаказПокупателя ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ДатаОтправки", ДатаОтправки);  
	
	МассивЗаказов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗаказПокупателя");
	
	Если МассивЗаказов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСоответсвие = Новый Структура;
	ПараметрыСоответсвие.Вставить("ДетальнаяИнформация", "1");
	
	ДатаЗапроса = ТекущаяДата();
	
	СтруктураРезультата = МодульИнтеграцииСПорталом.ПолучитьДанныеПоЗаказамСервер(ПараметрыСоответсвие, МассивЗаказов);
	
	Если СтруктураРезультата.Результат Тогда
		
		НачатьТранзакцию();	
		
		Попытка
			
			СоздатьИсходящееПоДанным(СтруктураРезультата.Данные, ДатаЗапроса);
			
			Для каждого Заказ Из МассивЗаказов Цикл
				
				Менеджер = РегистрыСведений.ОчередьОтправкиСтатусовПоЗаказам.СоздатьМенеджерЗаписи();
				Менеджер.ЗаказПокупателя = Заказ;
				Менеджер.Прочитать(); 
				
				Если ЗначениеЗаполнено(Менеджер.ДатаПредполагаемойОтправки) И Менеджер.ДатаПредполагаемойОтправки > ДатаОтправки Тогда
					//Ничего не делаем, считаем что кто-то уже перезаписал в очередь этот заказ во время выполнения запроса по статусам	
				Иначе
					Менеджер.Удалить();	
				КонецЕсли;				
				
			КонецЦикла; 
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
		КонецПопытки;
			
	Иначе
		
		Для каждого Заказ Из МассивЗаказов Цикл
			
			Менеджер = РегистрыСведений.ОчередьОтправкиСтатусовПоЗаказам.СоздатьМенеджерЗаписи();
			Менеджер.ЗаказПокупателя = Заказ;
			Менеджер.Прочитать();
			Менеджер.Ошибка = СтруктураРезультата.Сообщение;
			
			Если Менеджер.Выбран() Тогда
				Менеджер.КоличествоПопытокОтправки = Менеджер.КоличествоПопытокОтправки + 1;	
			КонецЕсли;
			
			Менеджер.Записать(Истина);
			
		КонецЦикла;
				
	КонецЕсли;                        	
	
КонецПроцедуры

Процедура СоздатьИсходящееПоДанным(ДанныеСтруктура, ДатаЗапроса)
	
	НовоеСообщение = Справочники.ИсходящиеСообщения.СоздатьЭлемент();  
	НовоеСообщение.ОбменДанными.Загрузка = Истина;
	НовоеСообщение.ДатаВремяСобытия = ДатаЗапроса; 
	НовоеСообщение.ТочкаПубликации = Константы.AMQP_Exchange.Получить(); 
	НовоеСообщение.Сообщение = ОбщегоНазначения.ВернутьJSON(ДанныеСтруктура);
	
	ID = Новый УникальныйИдентификатор();     	
	НовоеСообщение.УстановитьСсылкуНового(Справочники.ИсходящиеСообщения.ПолучитьСсылку(ID));
	
	Свойства = Новый СписокЗначений;
	Свойства.Добавить("ТипСодержимого", "application/json"); 
	Свойства.Добавить("ОтметкаВремени", AMQP_РаботаСДокументами_ver2.ДатуВTimestamp(НовоеСообщение.ДатаВремяСобытия));   	
	Свойства.Добавить("Тип", "document"); 
	Свойства.Добавить("ИмяПриложения",  Константы.AMQP_ИдентификаторИнформацСистемы.Получить());
	Свойства.Добавить("РежимДоставки",  2);
	Свойства.Добавить("НомерСообщения", Строка(НовоеСообщение.ПолучитьСсылкуНового().УникальныйИдентификатор())); 
	
	Для каждого Св Из Свойства Цикл
		
		НСтр = НовоеСообщение.Свойства.Добавить();
		НСтр.Значение = Св.Представление;
		НСтр.Наименование = Св.Значение;
		
	КонецЦикла;   
	
	Заголовки = Новый СписокЗначений;
	Заголовки.Добавить("document_type", "status");  
	Заголовки.Добавить("ПараметрыПодключения1С", СтрокаСоединенияИнформационнойБазы());  
	
	Для каждого За Из Заголовки Цикл
		
		НСтр = НовоеСообщение.Заголовки.Добавить();
		НСтр.Значение = За.Представление;
		НСтр.Наименование = За.Значение;
		
	КонецЦикла;   
	
	НовоеСообщение.Записать();
	
КонецПроцедуры

Процедура ПоместитьВОчередьВФоне(Источник) Экспорт
	
	ПараметрыВызова = Новый Массив;
	ПараметрыВызова.Добавить(Источник.Ссылка);
	
	ЗаданиеВыгрузки = ФоновыеЗадания.Выполнить("СтатусыЗаказов.ПоместитьВОчередь", ПараметрыВызова,, "Помещение в очередь выгрузки статусов заказа");		
	
КонецПроцедуры

Процедура ПоместитьВОчередь(ИсточникСсылка) Экспорт
	
	ТаблицаДвижения = ПолучитьТаблицуДвиженияСтатуса(ИсточникСсылка);
	
	Для каждого Стр Из ТаблицаДвижения Цикл
		
		Если Не ЗначениеЗаполнено(Стр.ЗаказПокупателя) Тогда
			Продолжить;
		КонецЕсли;
		
		Менеджер = РегистрыСведений.ОчередьОтправкиСтатусовПоЗаказам.СоздатьМенеджерЗаписи();
		Менеджер.ЗаказПокупателя = Стр.ЗаказПокупателя;
		Менеджер.ДатаПредполагаемойОтправки = ТекущаяДата() + 10;
		Менеджер.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТаблицуДвиженияСтатуса(ДокументДвижения)

	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаПоДокументу(ДокументДвижения);
	Запрос.Параметры.Вставить("ДокументДвижения", ДокументДвижения);
	
	ТаблицаДвижения = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДвижения;

КонецФункции

Функция ПолучитьТекстЗапросаПоДокументу(ДокументСсылка)
	
	ТекстЗапроса = "";

	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ТекстЗапроса = ПолучитьТекстЗапросаЗаказаПокупателя();               
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("СправочникСсылка.НеСозданныеЗаказыПокупателей") Тогда
		ТекстЗапроса = ПолучитьТекстЗапросаНесозданныеЗаказыПокупателя();	
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
		ТекстЗапроса = ПолучитьТекстЗапросаРеализацияТоваровУслуг();
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КорректировкаЗаказаПокупателя") Тогда
		ТекстЗапроса = ПолучитьТекстЗапросаКорректировкаЗаказаПокупателя();
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ГрузовоеМесто") Тогда 
		ТекстЗапроса = ПолучитьТекстЗапросаГрузовоеМесто();		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СборкаЗаказовПокупателя") Тогда 
		ТекстЗапроса = ПолучитьТекстЗапросаСборкаЗаказовПокупателя();		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда  
		ТекстЗапроса = ПолучитьТекстЗапросаЗаказПоставщику();
	//+Сёмин Р.И. 11.03.2026 #UT10-5721
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПогрузкаВАвто") Тогда  
		ТекстЗапроса = ПолучитьТекстЗапросаПогрузкаВАвто();
	//-Сёмин Р.И. 11.03.2026 #UT10-5721
	КонецЕсли;	
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ПолучитьТекстЗапросаЗаказаПокупателя()

	ТекстЗапроса = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Ссылка КАК ЗаказПокупателя
	               |ПОМЕСТИТЬ ВТ_ТоварыДокумента
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &ДокументДвижения
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказПокупателя.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТоварыДокумента.ЗаказПокупателя
	               |ИЗ
	               |	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента
	               |ГДЕ
	               |	ВТ_ТоварыДокумента.ЗаказПокупателя.Проведен";      
	
	Возврат ТекстЗапроса;

КонецФункции	

Функция ПолучитьТекстЗапросаНесозданныеЗаказыПокупателя()

	ТекстЗапроса = "ВЫБРАТЬ
	               |	НеСозданныеЗаказыПокупателей.Ссылка КАК ЗаказПокупателя
	               |ПОМЕСТИТЬ ВТ_ТоварыДокумента
	               |ИЗ
	               |	Справочник.НеСозданныеЗаказыПокупателей КАК НеСозданныеЗаказыПокупателей
	               |ГДЕ
	               |	НеСозданныеЗаказыПокупателей.Ссылка = &ДокументДвижения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТоварыДокумента.ЗаказПокупателя
	               |ИЗ
	               |	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента";      
	
	Возврат ТекстЗапроса;

КонецФункции	

Функция ПолучитьТекстЗапросаРеализацияТоваровУслуг()

	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТоварыДокумента.ЗаказПокупателя КАК ЗаказПокупателя
	               |ПОМЕСТИТЬ ВТ_ТоварыДокумента
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК ТоварыДокумента
	               |ГДЕ
	               |	ТоварыДокумента.Ссылка = &ДокументДвижения
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыДокумента.ЗаказПокупателя
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТоварыДокумента.ЗаказПокупателя
	               |ИЗ
	               |	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента
	               |ГДЕ
	               |	ВТ_ТоварыДокумента.ЗаказПокупателя.Проведен";     
	
	Возврат ТекстЗапроса;

КонецФункции	

Функция ПолучитьТекстЗапросаКорректировкаЗаказаПокупателя()

	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТоварыДокумента.Ссылка.ЗаказПокупателя КАК ЗаказПокупателя
	               |ПОМЕСТИТЬ ВТ_ТоварыДокумента
	               |ИЗ
	               |	Документ.КорректировкаЗаказаПокупателя.Товары КАК ТоварыДокумента
	               |ГДЕ
	               |	ТоварыДокумента.Ссылка = &ДокументДвижения
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыДокумента.Ссылка.ЗаказПокупателя
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТоварыДокумента.ЗаказПокупателя
	               |ИЗ
	               |	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента
	               |ГДЕ
	               |	ВТ_ТоварыДокумента.ЗаказПокупателя.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ТоварыДокумента.ЗаказПокупателя";
	
	Возврат ТекстЗапроса;
	
КонецФункции                   

Функция ПолучитьТекстЗапросаГрузовоеМесто()

	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТоварыДокумента.Заказ КАК ЗаказПокупателя
	               |ПОМЕСТИТЬ ВТ_ТоварыДокумента
	               |ИЗ
	               |	Документ.ГрузовоеМесто.Товары КАК ТоварыДокумента
	               |ГДЕ
	               |	ТоварыДокумента.Ссылка = &ДокументДвижения
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыДокумента.Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТоварыДокумента.ЗаказПокупателя
	               |ИЗ
	               |	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента
	               |ГДЕ
	               |	ВТ_ТоварыДокумента.ЗаказПокупателя.Проведен";     
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ПолучитьТекстЗапросаСборкаЗаказовПокупателя()

	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТоварыДокумента.Заказ КАК ЗаказПокупателя
	               |ПОМЕСТИТЬ ВТ_ТоварыДокумента
	               |ИЗ
	               |	Документ.СборкаЗаказовПокупателя.Заказано КАК ТоварыДокумента
	               |ГДЕ
	               |	ТоварыДокумента.Ссылка = &ДокументДвижения
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыДокумента.Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТоварыДокумента.ЗаказПокупателя
	               |ИЗ
	               |	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента
	               |ГДЕ
	               |	ВТ_ТоварыДокумента.ЗаказПокупателя.Проведен";	
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ПолучитьТекстЗапросаЗаказПоставщику()

	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(ТоварыДокумента.Заказ КАК Документ.ЗаказПокупателя) КАК ЗаказПокупателя
	               |ПОМЕСТИТЬ ВТ_ТоварыДокумента
	               |ИЗ
	               |	Документ.ЗаказПоставщику.Товары КАК ТоварыДокумента
	               |ГДЕ
	               |	ТоварыДокумента.Ссылка = &ДокументДвижения
	               |	И ТоварыДокумента.Заказ ССЫЛКА Документ.ЗаказПокупателя
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫРАЗИТЬ(ТоварыДокумента.Заказ КАК Документ.ЗаказПокупателя)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТоварыДокумента.ЗаказПокупателя
	               |ИЗ
	               |	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента
	               |ГДЕ
	               |	ВТ_ТоварыДокумента.ЗаказПокупателя.Проведен";     
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ПолучитьТекстЗапросаПогрузкаВАвто()
	
	//+Сёмин Р.И. 11.03.2026 #UT10-5721
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(ПогрузкаВАвтоПогружено.Грузоместо КАК Документ.ГрузовоеМесто) КАК ГрузовоеМесто
	               |ПОМЕСТИТЬ ВТ_ГрузовыеМеста
	               |ИЗ
	               |	Документ.ПогрузкаВАвто.Погружено КАК ПогрузкаВАвтоПогружено
	               |ГДЕ
	               |	ПогрузкаВАвтоПогружено.Ссылка = &ДокументДвижения
	               |	И ПогрузкаВАвтоПогружено.Грузоместо ССЫЛКА Документ.ГрузовоеМесто
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ГрузовоеМестоТовары.Заказ КАК ЗаказПокупателя
	               |ПОМЕСТИТЬ ВТ_Заказы
	               |ИЗ
	               |	Документ.ГрузовоеМесто.Товары КАК ГрузовоеМестоТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГрузовыеМеста КАК ВТ_ГрузовыеМеста
	               |		ПО ГрузовоеМестоТовары.Ссылка = ВТ_ГрузовыеМеста.ГрузовоеМесто
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ГрузовоеМестоТовары.Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Заказы.ЗаказПокупателя
	               |ИЗ
	               |	ВТ_Заказы КАК ВТ_Заказы
	               |ГДЕ
	               |	ВТ_Заказы.ЗаказПокупателя.Проведен";
	
	Возврат ТекстЗапроса;
	//-Сёмин Р.И. 11.03.2026 #UT10-5721
	
КонецФункции


///////////////////Общие процедуры и функции///////////////////


///////////////////Вспомогательные процедуры///////////////////
